## SQLite

![SQLite logo](https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/SQLite370.svg/320px-SQLite370.svg.png)

----------------------------------
sqlite3 Python documentation


https://docs.python.org/3.7/library/sqlite3.html


The sqlite3 Python package documentation page.

-------------------------------------------

### Databases

![MySQL client](https://upload.wikimedia.org/wikipedia/commons/d/dd/Mysql-screenshot.PNG)


People use the term database to sometimes mean:
* The data set itself.
* A program that manages datasets.
* The computer that runs the program.

A database is not a particular dataset but a theoretical idea of a dataset thats well structured? Well, databases are really just efficient ways of storing data/info.

-----------------

### Purposes

* Persistent storage.
* Fast data storage and retrieval algorithms.
* Dealing with multi-user conflicts.

---------------------

### Types

![Relational database table](https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/DVD_Rental_Query.png/554px-DVD_Rental_Query.png)

* Relational databases where data are structured in tables.
* NoSQL databases with no particular structure.
* Relational versus all other types, because relational are historically the most common.
    
----------------------

### Many tables 

![SQL join](https://i2.wp.com/ramkedem.com/wp-content/uploads/2015/08/sql_inner_join.png?w=600)

* Excel is great for single table scenarios.
* Gets a little clunky when you have two or more tables that are related.


Only two types of databases: Relational (narrow but v popular, e.g. MySQL) or NOSQL types. Relational databases are great at working with and merging the tables together and using various functions. Excel spreadsheets can only handle smaller datasets. Whereas a database system is much faster and up to the job.

-------------------------



### Connections

* Database server/management system is a program running on some machine.
* Access it by knowing the connection details, supplied by the database administrator.
* Typcially need database type, IP address, port, username, password, database name.

In [ ]:
import mysql.connector
cnx = mysql.connector.connect(user='scott', password='password',
                              host='127.0.0.1',
                              database='employees')
cnx.close()

### SQLite

* Simple database that runs in memory.
* Not really a separate program/process/software - it's part of your program.
* Uses the SQL language.

### SQL

* Structured Query Language.
* Simple syntax.
* State what you want, not how to get it.
* CRUD: Create, Retrieve, Update, Delete.

In [ ]:
CREATE TABLE person(id AUTOINCREMENT PRIMARY KEY, name VARCHAR(255), address VARCHAR(255));
    INSERT INTO person VALUES("Joe Bloggs", "Galway");
    SELECT name FROM person;
    UPDATE person SET address="Sligo" WHERE name="Joe Bloggs";
    DELETE FROM person WHERE name="Joe Bloggs";
    DROP TABLE person;

### Join in pandas

https://pandas.pydata.org/pandas-docs/stable/comparison_with_sql.html

In [1]:
import pandas as pd

person = pd.read_csv("https://github.com/ianmcloughlin/datasets/raw/master/cars-db/person.csv", index_col=0)
person.head(10)

                   Name    Address
ID
0            Anna Henry     Carlow
1           Shelby Beck  Tipperary
2            Marie Carr      Kerry
3           Sarah Heath   Monaghan
4         Robert Snyder    Leitrim
5            Lucas Ross       Cork
6             David Cox    Leitrim
7          Jackson Dean      Louth
8   Elizabeth Mcfarland     Dublin
9      Timothy Cummings   Limerick

In [2]:
car = pd.read_csv("https://github.com/ianmcloughlin/datasets/raw/master/cars-db/car.csv", index_col=0)
car.head(10)

   Registration  OwnerId
ID
0   08-SO-11072        9
1   16-KE-16368       97
2   08-LD-16871       17
3   11-KY-17442       22
4   16-LD-17545       48
5    10-WH-3543       10
6    03-KE-8148       74
7    06-G-23024        4
8   08-LS-21770       93
9   03-WX-41717       53

In [7]:
county = pd.read_csv("https://github.com/ianmcloughlin/datasets/raw/master/cars-db/county.csv", index_col=0)
county.head(10)

# Owner ID is the same as the ID column in the "person" table

   Registration      Name
ID
0            CW    Carlow
1            CN     Cavan
2            CE     Clare
3             C      Cork
4            DL   Donegal
5             D    Dublin
6             G    Galway
7            KY     Kerry
8            KE   Kildare
9            KK  Kilkenny

In [4]:
# Join the car and person data frames on two columns.
pd.merge(car, person, left_on="OwnerId", right_on="ID", how="left")[["Registration", "Name"]].head() # car table on left, person table on right

  Registration              Name
0  08-SO-11072  Timothy Cummings
1  16-KE-16368         Dana Wade
2  08-LD-16871   Valerie Stewart
3  11-KY-17442   Gregory Vazquez
4  16-LD-17545          Sara Lee

In [5]:
# Find people with cars registered in counties other than where they live.
tmp = pd.merge(car, person, left_on="OwnerId", right_on="ID", how="left") 
tmp = pd.merge(tmp, county, left_on="Address", right_on="Name", how="left")

tmp['Registration_x'] = tmp['Registration_x'].apply(lambda x: x.split("-")[1]) # Matching algorithm
tmp = tmp[tmp['Registration_x'] != tmp['Registration_y']]
tmp.head(10)

,Registration_x,OwnerId,Name_x,Address,Registration_y,Name_y
0,SO,9,Timothy Cummings,Limerick,L,Limerick
1,KE,97,Dana Wade,Mayo,MO,Mayo
3,KY,22,Gregory Vazquez,Sligo,SO,Sligo
4,LD,48,Sara Lee,Laois,LS,Laois
5,WH,10,Jennifer Reeves,Offaly,OY,Offaly
6,KE,74,Leonard Chen,Galway,G,Galway
7,G,4,Robert Snyder,Leitrim,LM,Leitrim
8,LS,93,Morgan Marsh,Westmeath,WH,Westmeath
9,WX,53,Kayla Rodriguez DVM,Clare,CE,Clare
10,T,63,Robert Acevedo,Meath,MH,Meath

Thus, these datasets all relate to each other and we can perform functions to merge and manipulate etc.

### SQLite in Python

In [8]:
import sqlite3